testdata/IN_2023_02/Roundtrip/produkt/kapital/tf2/20141229_tf2_risikofragen_2023_02b.xml_request_2023_02b.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <tarif:getQuoteQuestions xmlns:allg="http://www.bipro.net/namespace/allgemein" xmlns:basis="http://www.bipro.net/namespace/basis" xmlns:dt="http://www.bipro.net/namespace/datentypen" xmlns:gevo="http://www.bipro.net/namespace/gevo" xmlns:nachr="http://www.bipro.net/namespace/nachrichten" xmlns:partner="http://www.bipro.net/namespace/partner" xmlns:pm="http://www.bipro.net/namespace/produktmodell" xmlns:pm-leben="http://www.bipro.net/namespace/versicherung/produktmodell/leben" xmlns:tarif="http://www.bipro.net/namespace/versicherung/tarifierung" xmlns:vbl="urn:de:vb:bipro:taa:leben:1.12" xmlns:vs-pm="http://www.bipro.net/namespace/versicherung/produktmodell" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
         
      <tarif:Request>
              
        <nachr:BiPROVersion>2.4.6.1.12</nachr:BiPROVersion>
        <nachr:ConsumerID>WS DEV TEAM</nachr:ConsumerID>
              
        <tarif:Tarifierung>
                   
          <gevo:Vermittler>
                        
            <allg:Vermittlernummer>111/222</allg:Vermittlernummer>
                     
          </gevo:Vermittler>
                   
          <tarif:Partner xsi:type="partner:CT_Person">
                        
            <partner:Anrede>1</partner:Anrede>
                        
            <partner:PartnerID>1</partner:PartnerID>
                      
            <partner:Geburtsdatum>1992-11-01</partner:Geburtsdatum>
                      
            <partner:Geschlecht>1</partner:Geschlecht>
                     
          </tarif:Partner>
                  
          <tarif:Partner xsi:type="partner:CT_Person">
                      
            <partner:PartnerID>10</partner:PartnerID>
                      
            <partner:Partnerbeziehung>
                          
              <partner:PartnerID>1</partner:PartnerID>
                          
              <partner:Art xsi:type="dt:STE_PartnerbeziehungBasis">03</partner:Art>
                        
            </partner:Partnerbeziehung>
                      
            <partner:Geburtsdatum>2010-01-01</partner:Geburtsdatum>
                    
          </tarif:Partner>
                   
          <tarif:Versicherungsnehmer>
                        
            <partner:PartnerID>1</partner:PartnerID>
                     
          </tarif:Versicherungsnehmer>
                   
          <tarif:Verkaufsprodukt>
                        
            <pm:Produkt xsi:type="pm-leben:CT_Produkt">
                             
              <basis:Erweiterung xsi:type="vbl:CT_ProduktErweiterung">
                                  
                <vbl:Tarifgruppe>Normal</vbl:Tarifgruppe>
                               
              </basis:Erweiterung>
                             
              <pm:GewuenschteZahlungsweise>8</pm:GewuenschteZahlungsweise>
                                
              <pm:Beitrag>
                                     
                <pm:ArtID xsi:type="dt:STE_BeitragBasis">01</pm:ArtID>
                                     
                <pm:Zahlungsweise>8</pm:Zahlungsweise>
                                     
                <pm:Erhebung>
                                         
                  <allg:AnzahlJahre>20</allg:AnzahlJahre>
                                       
                </pm:Erhebung>
                                  
              </pm:Beitrag>
                             
              <pm:Versicherungsdauer>
                                 
                <allg:Beginn>2023-03-01T12:00</allg:Beginn>
                               
              </pm:Versicherungsdauer>
                             
              <pm:Kennung>TF2</pm:Kennung>
                             
              <pm:Elementarprodukt xsi:type="pm-leben:CT_KapitalbildendeVersicherung">
                                  
                <pm:Versicherungsdauer>
                                      
                  <allg:AnzahlJahre>20</allg:AnzahlJahre>
                                    
                </pm:Versicherungsdauer>
                                  
                <vs-pm:VersicherungssummeOderLeistung>
                                       
                  <vs-pm:ArtID xsi:type="dt:STE_VersicherungssummeOderLeistungBasis">Versicherungssumme</vs-pm:ArtID>
                                       
                  <vs-pm:Wert>10000</vs-pm:Wert>
                                       
                  <vs-pm:Werteinheit>20</vs-pm:Werteinheit>
                                       
                  <vs-pm:Waehrung>EUR</vs-pm:Waehrung>
                                       
                  <vs-pm:Auszahlungsweise>6</vs-pm:Auszahlungsweise>
                                    
                </vs-pm:VersicherungssummeOderLeistung>
                                  
                <pm-leben:IstHauptversicherung>true</pm-leben:IstHauptversicherung>
                                  
                <pm-leben:UeberschussverwendungVorLeistung xsi:type="dt:STE_UeberschussverwendungBasis">00</pm-leben:UeberschussverwendungVorLeistung>
                                  
                <pm-leben:VersichertePerson>
                                       
                  <partner:PartnerID>1</partner:PartnerID>
                                    
                </pm-leben:VersichertePerson>
                               
              </pm:Elementarprodukt>
                                  
              <pm-leben:VorgabeBerechnung>
                                  
                <pm-leben:ArtID xsi:type="dt:STE_VorgabeBerechnungBasis">Versicherungssumme</pm-leben:ArtID>
                                  
                <pm-leben:Kontext xsi:type="dt:STE_VorgabeBerechnungKontextBasis">KapitalbildendeVersicherung</pm-leben:Kontext>
                               
              </pm-leben:VorgabeBerechnung>
                          
            </pm:Produkt>
                     
          </tarif:Verkaufsprodukt>
                
        </tarif:Tarifierung>
           
      </tarif:Request>
      
    </tarif:getQuoteQuestions>
  </soapenv:Body>
</soapenv:Envelope>
